bases/WIM_FIn/projects/IMAPPS-39438 Доработка обработки Формирование начислений НДФЛ/Расширения/IMAPPS39438_EmptyTurnover/DataProcessors/ФормированиеНачисленийНДФЛ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ФормированиеНачисленийНДФЛ</Name>
		</Properties>
		<ChildObjects>
		
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВариантЗаполнения</Name>
					<Type><v8:Type>xs:decimal</v8:Type><v8:NumberQualifiers><v8:Digits>1</v8:Digits><v8:FractionDigits>0</v8:FractionDigits><v8:AllowedSign>Any</v8:AllowedSign></v8:NumberQualifiers></Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Клиент</Name>
					<Type><v8:Type>cfg:CatalogRef.Контрагенты</v8:Type></Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НалоговыйПериод</Name>
					<Type><v8:Type>cfg:CatalogRef.Периоды</v8:Type></Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НеСоздаватьДокументыБезУдержаний</Name>
					<Type><v8:Type>xs:boolean</v8:Type></Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НеСоздаватьДокументыПоКлиентамБезЦБ</Name>
					<Type><v8:Type>xs:boolean</v8:Type></Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерСтрокиПо</Name>
					<Type><v8:Type>xs:decimal</v8:Type><v8:NumberQualifiers><v8:Digits>10</v8:Digits><v8:FractionDigits>0</v8:FractionDigits><v8:AllowedSign>Nonnegative</v8:AllowedSign></v8:NumberQualifiers></Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерСтрокиС</Name>
					<Type><v8:Type>xs:decimal</v8:Type><v8:NumberQualifiers><v8:Digits>10</v8:Digits><v8:FractionDigits>0</v8:FractionDigits><v8:AllowedSign>Any</v8:AllowedSign></v8:NumberQualifiers></Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Период</Name>
					<Type><v8:Type>v8:StandardPeriod</v8:Type></Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СоздаватьОплатуНДФЛ</Name>
					<Type><v8:Type>xs:boolean</v8:Type></Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СхемаВыплаты</Name>
					<Type><v8:Type>xs:decimal</v8:Type><v8:NumberQualifiers><v8:Digits>1</v8:Digits><v8:FractionDigits>0</v8:FractionDigits><v8:AllowedSign>Any</v8:AllowedSign></v8:NumberQualifiers></Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СчетДляОплатыНалогов</Name>
					<Type><v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type></Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>УправляющаяКомпания</Name>
					<Type><v8:Type>cfg:CatalogRef.Контрагенты</v8:Type></Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ФормироватьНачисленияПоЗакрытымПортфелям</Name>
					<Type><v8:Type>xs:boolean</v8:Type></Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ФормироватьНачисленияТолькоПоПортфелямСДвижениямиПоНДФЛ</Name>
					<Type><v8:Type>xs:boolean</v8:Type></Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ФормироватьПоЗакрытымПортфелямСПоступлениемНКД</Name>
					<Type><v8:Type>xs:boolean</v8:Type></Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеСоздаватьНДФЛПоКлиентамБезОборотов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетаОборотовДляОтбораНДФЛ</Name>
					<Comment/><Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатыДокументов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Дата</Name>
							<Type><v8:Type>xs:dateTime</v8:Type><v8:DateQualifiers><v8:DateFractions>Date</v8:DateFractions></v8:DateQualifiers></Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>УправляющаяКомпания</Name>
							<Type><v8:Type>cfg:CatalogRef.Контрагенты</v8:Type></Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Клиент</Name>
							<Type><v8:Type>cfg:CatalogRef.Контрагенты</v8:Type></Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СхемаРеинвестирования</Name>
							<Type><v8:Type>xs:string</v8:Type><v8:StringQualifiers><v8:Length>20</v8:Length><v8:AllowedLength>Variable</v8:AllowedLength></v8:StringQualifiers></Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

bases/WIM_FIn/projects/IMAPPS-39438 Доработка обработки Формирование начислений НДФЛ/Расширения/IMAPPS39438_EmptyTurnover/DataProcessors/ФормированиеНачисленийНДФЛ/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область IMAPPS39438

&После("ЗаполнитьДатыДокументов")
Процедура IMAPPS39438_ЗаполнитьДатыДокументов()

	// IMAPPS-39438
	IMAPPS39438_ОставитьТолькоПарыСОборотами();

КонецПроцедуры

// IMAPPS-39438. После штатного заполнения оставляет в ТЧ ДатыДокументов
// только пары клиент+УК, у которых за период есть обороты по счетам доходов.
//
Процедура IMAPPS39438_ОставитьТолькоПарыСОборотами()

	Если Не НеСоздаватьНДФЛПоКлиентамБезОборотов Тогда
		Возврат;
	КонецЕсли;

	Если ДатыДокументов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	СтрокаСчетов = СокрЛП(СчетаОборотовДляОтбораНДФЛ);
	Если Не ЗначениеЗаполнено(СтрокаСчетов) Тогда
		СтрокаСчетов = "90.01, 91.01, 91.03";
	КонецЕсли;

	СчетаОборотов = ПланыСчетов.Хозрасчетный.СчетаПоСтроке(СтрокаСчетов);

	ПарыСОборотами = Новый Соответствие;

	Если СчетаОборотов.Количество() = 0 Тогда
		Сообщить("IMAPPS-39438. Не разобран список счетов отбора НДФЛ. Фильтр не применен.");
		Для Каждого СтрокаТЧ Из ДатыДокументов Цикл
			КлючПары = Строка(СтрокаТЧ.Клиент.УникальныйИдентификатор())
				+ "|"
				+ Строка(СтрокаТЧ.УправляющаяКомпания.УникальныйИдентификатор());
			ПарыСОборотами.Вставить(КлючПары, Истина);
		КонецЦикла;
	Иначе

		Если ВариантЗаполнения = 2 Или ВариантЗаполнения = 4 Тогда
			НачалоПериодаОтбора = НачалоГода(Период.ДатаОкончания);
			КонецПериодаОтбора = Новый Граница(КонецДня(Период.ДатаОкончания), ВидГраницы.Включая);
		ИначеЕсли ВариантЗаполнения = 0 Или ВариантЗаполнения = 1 Тогда
			НачалоПериодаОтбора = Период.ДатаНачала;
			КонецПериодаОтбора = Новый Граница(КонецДня(Период.ДатаОкончания), ВидГраницы.Включая);
		Иначе
			ЕстьДата = Ложь;
			ДатаМин = Дата(1, 1, 1);
			ДатаМакс = Дата(1, 1, 1);
			Для Каждого СтрокаТЧ Из ДатыДокументов Цикл
				Если Не ЕстьДата Тогда
					ДатаМин = СтрокаТЧ.Дата;
					ДатаМакс = СтрокаТЧ.Дата;
					ЕстьДата = Истина;
				Иначе
					Если СтрокаТЧ.Дата < ДатаМин Тогда
						ДатаМин = СтрокаТЧ.Дата;
					КонецЕсли;
					Если СтрокаТЧ.Дата > ДатаМакс Тогда
						ДатаМакс = СтрокаТЧ.Дата;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			Если Не ЕстьДата Тогда
				ДатаМин = ТекущаяДатаСеанса();
				ДатаМакс = ДатаМин;
			КонецЕсли;
			НачалоПериодаОтбора = ДатаМин;
			КонецПериодаОтбора = Новый Граница(КонецДня(ДатаМакс), ВидГраницы.Включая);
		КонецЕсли;

		ТаблицаПар = ДатыДокументов.Выгрузить(, "Клиент, УправляющаяКомпания");

		// IMAPPS-39438. Один запрос на заполнение: пары из ТЧ соединяются с оборотами,
		// чтобы клиент одной УК не смешался с другой.
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТЧ.Клиент КАК Клиент,
		|	ТЧ.УправляющаяКомпания КАК УправляющаяКомпания
		|ПОМЕСТИТЬ ВТ_Пары
		|ИЗ
		|	&ДатыДокументов КАК ТЧ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ХозрасчетныйОбороты.Портфель.Клиент КАК Клиент,
		|	ХозрасчетныйОбороты.Портфель.УправляющаяКомпания КАК УправляющаяКомпания
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.Обороты(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			,
		|			Счет В (&СчетаОборотов),
		|			,
		|			Портфель.Клиент В (&Клиенты)
		|				И Портфель.УправляющаяКомпания В (&УправляющиеКомпании),
		|			,
		|			) КАК ХозрасчетныйОбороты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Пары КАК ВТ_Пары
		|		ПО ХозрасчетныйОбороты.Портфель.Клиент = ВТ_Пары.Клиент
		|			И ХозрасчетныйОбороты.Портфель.УправляющаяКомпания = ВТ_Пары.УправляющаяКомпания
		|ГДЕ
		|	Не (ХозрасчетныйОбороты.СуммаОборотДт = 0
		|			И ХозрасчетныйОбороты.СуммаОборотКт = 0)";

		Запрос.УстановитьПараметр("ДатыДокументов", ТаблицаПар);
		Запрос.УстановитьПараметр("НачалоПериода", НачалоПериодаОтбора);
		Запрос.УстановитьПараметр("КонецПериода", КонецПериодаОтбора);
		Запрос.УстановитьПараметр("СчетаОборотов", СчетаОборотов);
		Запрос.УстановитьПараметр("Клиенты", ТаблицаПар.ВыгрузитьКолонку("Клиент"));
		Запрос.УстановитьПараметр("УправляющиеКомпании", ТаблицаПар.ВыгрузитьКолонку("УправляющаяКомпания"));

		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			КлючПары = Строка(Выборка.Клиент.УникальныйИдентификатор())
				+ "|"
				+ Строка(Выборка.УправляющаяКомпания.УникальныйИдентификатор());
			ПарыСОборотами.Вставить(КлючПары, Истина);
		КонецЦикла;

	КонецЕсли;

	Индекс = ДатыДокументов.Количество() - 1;
	Пока Индекс >= 0 Цикл
		СтрокаТЧ = ДатыДокументов[Индекс];
		КлючПары = Строка(СтрокаТЧ.Клиент.УникальныйИдентификатор())
			+ "|"
			+ Строка(СтрокаТЧ.УправляющаяКомпания.УникальныйИдентификатор());
		Если ПарыСОборотами.Получить(КлючПары) = Неопределено Тогда
			ДатыДокументов.Удалить(Индекс);
		КонецЕсли;
		Индекс = Индекс - 1;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#КонецЕсли
